Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32CX2051MTSH128_DFP/component/supc.h
#define SUPC_WUMR_LPDBC4_3_RTCOUT             (SUPC_WUMR_LPDBC4_3_RTCOUT_Val << SUPC_WUMR_LPDBC4_Pos) /* (SUPC_WUMR) WKUPx in active state for at least 3 RTCOUTx clock periods Position  */
#define SUPC_WUMR_LPDBC4_4_RTCOUT             (SUPC_WUMR_LPDBC4_4_RTCOUT_Val << SUPC_WUMR_LPDBC4_Pos) /* (SUPC_WUMR) WKUPx in active state for at least 4 RTCOUTx clock periods Position  */
#define SUPC_WUMR_LPDBC4_5_RTCOUT             (SUPC_WUMR_LPDBC4_5_RTCOUT_Val << SUPC_WUMR_LPDBC4_Pos) /* (SUPC_WUMR) WKUPx in active state for at least 5 RTCOUTx clock periods Position  */
#define SUPC_WUMR_LPDBC4_6_RTCOUT             (SUPC_WUMR_LPDBC4_6_RTCOUT_Val << SUPC_WUMR_LPDBC4_Pos) /* (SUPC_WUMR) WKUPx in active state for at least 6 RTCOUTx clock periods Position  */
#define SUPC_WUMR_LPDBC4_7_RTCOUT             (SUPC_WUMR_LPDBC4_7_RTCOUT_Val << SUPC_WUMR_LPDBC4_Pos) /* (SUPC_WUMR) WKUPx in active state for at least 7 RTCOUTx clock periods Position  */
#define SUPC_WUMR_LPDBC4_8_RTCOUT             (SUPC_WUMR_LPDBC4_8_RTCOUT_Val << SUPC_WUMR_LPDBC4_Pos) /* (SUPC_WUMR) WKUPx in active state for at least 8 RTCOUTx clock periods Position  */
#define SUPC_WUMR_Msk                         _UINT32_(0x7FFF771F)                                 /* (SUPC_WUMR) Register Mask  */

#define SUPC_WUMR_LPDBCEN_Pos                 _UINT32_(0)                                          /* (SUPC_WUMR Position) Tamper Enable for WKUPx Pin */
#define SUPC_WUMR_LPDBCEN_Msk                 (_UINT32_(0x1F) << SUPC_WUMR_LPDBCEN_Pos)            /* (SUPC_WUMR Mask) LPDBCEN */
#define SUPC_WUMR_LPDBCEN(value)              (SUPC_WUMR_LPDBCEN_Msk & (_UINT32_(value) << SUPC_WUMR_LPDBCEN_Pos)) 

/* -------- SUPC_WUIR : (SUPC Offset: 0x10) (R/W 32) Wakeup Inputs Register -------- */
#define SUPC_WUIR_WKUPEN0_Pos                 _UINT32_(0)                                          /* (SUPC_WUIR) Wake-up Input Enable 0 Position */
#define SUPC_WUIR_WKUPEN0_Msk                 (_UINT32_(0x1) << SUPC_WUIR_WKUPEN0_Pos)             /* (SUPC_WUIR) Wake-up Input Enable 0 Mask */
#define SUPC_WUIR_WKUPEN0(value)              (SUPC_WUIR_WKUPEN0_Msk & (_UINT32_(value) << SUPC_WUIR_WKUPEN0_Pos)) /* Assigment of value for WKUPEN0 in the SUPC_WUIR register */
#define SUPC_WUIR_WKUPEN1_Pos                 _UINT32_(1)                                          /* (SUPC_WUIR) Wake-up Input Enable 1 Position */
#define SUPC_WUIR_WKUPEN1_Msk                 (_UINT32_(0x1) << SUPC_WUIR_WKUPEN1_Pos)             /* (SUPC_WUIR) Wake-up Input Enable 1 Mask */
#define SUPC_WUIR_WKUPEN1(value)              (SUPC_WUIR_WKUPEN1_Msk & (_UINT32_(value) << SUPC_WUIR_WKUPEN1_Pos)) /* Assigment of value for WKUPEN1 in the SUPC_WUIR register */
#define SUPC_WUIR_WKUPEN2_Pos                 _UINT32_(2)                                          /* (SUPC_WUIR) Wake-up Input Enable 2 Position */
#define SUPC_WUIR_WKUPEN2_Msk                 (_UINT32_(0x1) << SUPC_WUIR_WKUPEN2_Pos)             /* (SUPC_WUIR) Wake-up Input Enable 2 Mask */
#define SUPC_WUIR_WKUPEN2(value)              (SUPC_WUIR_WKUPEN2_Msk & (_UINT32_(value) << SUPC_WUIR_WKUPEN2_Pos)) /* Assigment of value for WKUPEN2 in the SUPC_WUIR register */
#define SUPC_WUIR_WKUPEN3_Pos                 _UINT32_(3)                                          /* (SUPC_WUIR) Wake-up Input Enable 3 Position */
#define SUPC_WUIR_WKUPEN3_Msk                 (_UINT32_(0x1) << SUPC_WUIR_WKUPEN3_Pos)             /* (SUPC_WUIR) Wake-up Input Enable 3 Mask */
#define SUPC_WUIR_WKUPEN3(value)              (SUPC_WUIR_WKUPEN3_Msk & (_UINT32_(value) << SUPC_WUIR_WKUPEN3_Pos)) /* Assigment of value for WKUPEN3 in the SUPC_WUIR register */
#define SUPC_WUIR_WKUPEN4_Pos                 _UINT32_(4)                                          /* (SUPC_WUIR) Wake-up Input Enable 4 Position */
#define SUPC_WUIR_WKUPEN4_Msk                 (_UINT32_(0x1) << SUPC_WUIR_WKUPEN4_Pos)             /* (SUPC_WUIR) Wake-up Input Enable 4 Mask */
#define SUPC_WUIR_WKUPEN4(value)              (SUPC_WUIR_WKUPEN4_Msk & (_UINT32_(value) << SUPC_WUIR_WKUPEN4_Pos)) /* Assigment of value for WKUPEN4 in the SUPC_WUIR register */
#define SUPC_WUIR_WKUPEN5_Pos                 _UINT32_(5)                                          /* (SUPC_WUIR) Wake-up Input Enable 5 Position */
#define SUPC_WUIR_WKUPEN5_Msk                 (_UINT32_(0x1) << SUPC_WUIR_WKUPEN5_Pos)             /* (SUPC_WUIR) Wake-up Input Enable 5 Mask */
#define SUPC_WUIR_WKUPEN5(value)              (SUPC_WUIR_WKUPEN5_Msk & (_UINT32_(value) << SUPC_WUIR_WKUPEN5_Pos)) /* Assigment of value for WKUPEN5 in the SUPC_WUIR register */
#define SUPC_WUIR_WKUPEN6_Pos                 _UINT32_(6)                                          /* (SUPC_WUIR) Wake-up Input Enable 6 Position */
#define SUPC_WUIR_WKUPEN6_Msk                 (_UINT32_(0x1) << SUPC_WUIR_WKUPEN6_Pos)             /* (SUPC_WUIR) Wake-up Input Enable 6 Mask */
#define SUPC_WUIR_WKUPEN6(value)              (SUPC_WUIR_WKUPEN6_Msk & (_UINT32_(value) << SUPC_WUIR_WKUPEN6_Pos)) /* Assigment of value for WKUPEN6 in the SUPC_WUIR register */
#define SUPC_WUIR_WKUPEN7_Pos                 _UINT32_(7)                                          /* (SUPC_WUIR) Wake-up Input Enable 7 Position */
#define SUPC_WUIR_WKUPEN7_Msk                 (_UINT32_(0x1) << SUPC_WUIR_WKUPEN7_Pos)             /* (SUPC_WUIR) Wake-up Input Enable 7 Mask */
#define SUPC_WUIR_WKUPEN7(value)              (SUPC_WUIR_WKUPEN7_Msk & (_UINT32_(value) << SUPC_WUIR_WKUPEN7_Pos)) /* Assigment of value for WKUPEN7 in the SUPC_WUIR register */
#define SUPC_WUIR_WKUPEN8_Pos                 _UINT32_(8)                                          /* (SUPC_WUIR) Wake-up Input Enable 8 Position */
#define SUPC_WUIR_WKUPEN8_Msk                 (_UINT32_(0x1) << SUPC_WUIR_WKUPEN8_Pos)             /* (SUPC_WUIR) Wake-up Input Enable 8 Mask */
#define SUPC_WUIR_WKUPEN8(value)              (SUPC_WUIR_WKUPEN8_Msk & (_UINT32_(value) << SUPC_WUIR_WKUPEN8_Pos)) /* Assigment of value for WKUPEN8 in the SUPC_WUIR register */
#define SUPC_WUIR_WKUPEN9_Pos                 _UINT32_(9)                                          /* (SUPC_WUIR) Wake-up Input Enable 9 Position */
#define SUPC_WUIR_WKUPEN9_Msk                 (_UINT32_(0x1) << SUPC_WUIR_WKUPEN9_Pos)             /* (SUPC_WUIR) Wake-up Input Enable 9 Mask */
#define SUPC_WUIR_WKUPEN9(value)              (SUPC_WUIR_WKUPEN9_Msk & (_UINT32_(value) << SUPC_WUIR_WKUPEN9_Pos)) /* Assigment of value for WKUPEN9 in the SUPC_WUIR register */
#define SUPC_WUIR_WKUPEN10_Pos                _UINT32_(10)                                         /* (SUPC_WUIR) Wake-up Input Enable 10 Position */
#define SUPC_WUIR_WKUPEN10_Msk                (_UINT32_(0x1) << SUPC_WUIR_WKUPEN10_Pos)            /* (SUPC_WUIR) Wake-up Input Enable 10 Mask */
#define SUPC_WUIR_WKUPEN10(value)             (SUPC_WUIR_WKUPEN10_Msk & (_UINT32_(value) << SUPC_WUIR_WKUPEN10_Pos)) /* Assigment of value for WKUPEN10 in the SUPC_WUIR register */
#define SUPC_WUIR_WKUPEN11_Pos                _UINT32_(11)                                         /* (SUPC_WUIR) Wake-up Input Enable 11 Position */
#define SUPC_WUIR_WKUPEN11_Msk                (_UINT32_(0x1) << SUPC_WUIR_WKUPEN11_Pos)            /* (SUPC_WUIR) Wake-up Input Enable 11 Mask */
#define SUPC_WUIR_WKUPEN11(value)             (SUPC_WUIR_WKUPEN11_Msk & (_UINT32_(value) << SUPC_WUIR_WKUPEN11_Pos)) /* Assigment of value for WKUPEN11 in the SUPC_WUIR register */
#define SUPC_WUIR_WKUPEN12_Pos                _UINT32_(12)                                         /* (SUPC_WUIR) Wake-up Input Enable 12 Position */
#define SUPC_WUIR_WKUPEN12_Msk                (_UINT32_(0x1) << SUPC_WUIR_WKUPEN12_Pos)            /* (SUPC_WUIR) Wake-up Input Enable 12 Mask */
#define SUPC_WUIR_WKUPEN12(value)             (SUPC_WUIR_WKUPEN12_Msk & (_UINT32_(value) << SUPC_WUIR_WKUPEN12_Pos)) /* Assigment of value for WKUPEN12 in the SUPC_WUIR register */
#define SUPC_WUIR_WKUPEN13_Pos                _UINT32_(13)                                         /* (SUPC_WUIR) Wake-up Input Enable 13 Position */
#define SUPC_WUIR_WKUPEN13_Msk                (_UINT32_(0x1) << SUPC_WUIR_WKUPEN13_Pos)            /* (SUPC_WUIR) Wake-up Input Enable 13 Mask */
#define SUPC_WUIR_WKUPEN13(value)             (SUPC_WUIR_WKUPEN13_Msk & (_UINT32_(value) << SUPC_WUIR_WKUPEN13_Pos)) /* Assigment of value for WKUPEN13 in the SUPC_WUIR register */
#define SUPC_WUIR_WKUPEN14_Pos                _UINT32_(14)                                         /* (SUPC_WUIR) Wake-up Input Enable 14 Position */
#define SUPC_WUIR_WKUPEN14_Msk                (_UINT32_(0x1) << SUPC_WUIR_WKUPEN14_Pos)            /* (SUPC_WUIR) Wake-up Input Enable 14 Mask */
#define SUPC_WUIR_WKUPEN14(value)             (SUPC_WUIR_WKUPEN14_Msk & (_UINT32_(value) << SUPC_WUIR_WKUPEN14_Pos)) /* Assigment of value for WKUPEN14 in the SUPC_WUIR register */
#define SUPC_WUIR_WKUPT0_Pos                  _UINT32_(16)                                         /* (SUPC_WUIR) Wake-up Input Type 0 Position */
#define SUPC_WUIR_WKUPT0_Msk                  (_UINT32_(0x1) << SUPC_WUIR_WKUPT0_Pos)              /* (SUPC_WUIR) Wake-up Input Type 0 Mask */
#define SUPC_WUIR_WKUPT0(value)               (SUPC_WUIR_WKUPT0_Msk & (_UINT32_(value) << SUPC_WUIR_WKUPT0_Pos)) /* Assigment of value for WKUPT0 in the SUPC_WUIR register */
#define   SUPC_WUIR_WKUPT0_LOW_Val            _UINT32_(0x0)                                        /* (SUPC_WUIR) A falling edge followed by a low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply.  */
#define   SUPC_WUIR_WKUPT0_HIGH_Val           _UINT32_(0x1)                                        /* (SUPC_WUIR) A rising edge followed by a high level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply.  */
#define SUPC_WUIR_WKUPT0_LOW                  (SUPC_WUIR_WKUPT0_LOW_Val << SUPC_WUIR_WKUPT0_Pos)   /* (SUPC_WUIR) A falling edge followed by a low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply. Position  */
#define SUPC_WUIR_WKUPT0_HIGH                 (SUPC_WUIR_WKUPT0_HIGH_Val << SUPC_WUIR_WKUPT0_Pos)  /* (SUPC_WUIR) A rising edge followed by a high level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply. Position  */
#define SUPC_WUIR_WKUPT1_Pos                  _UINT32_(17)                                         /* (SUPC_WUIR) Wake-up Input Type 1 Position */
#define SUPC_WUIR_WKUPT1_Msk                  (_UINT32_(0x1) << SUPC_WUIR_WKUPT1_Pos)              /* (SUPC_WUIR) Wake-up Input Type 1 Mask */
#define SUPC_WUIR_WKUPT1(value)               (SUPC_WUIR_WKUPT1_Msk & (_UINT32_(value) << SUPC_WUIR_WKUPT1_Pos)) /* Assigment of value for WKUPT1 in the SUPC_WUIR register */
#define   SUPC_WUIR_WKUPT1_LOW_Val            _UINT32_(0x0)                                        /* (SUPC_WUIR) A falling edge followed by a low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply.  */
#define   SUPC_WUIR_WKUPT1_HIGH_Val           _UINT32_(0x1)                                        /* (SUPC_WUIR) A rising edge followed by a high level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply.  */
#define SUPC_WUIR_WKUPT1_LOW                  (SUPC_WUIR_WKUPT1_LOW_Val << SUPC_WUIR_WKUPT1_Pos)   /* (SUPC_WUIR) A falling edge followed by a low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply. Position  */
#define SUPC_WUIR_WKUPT1_HIGH                 (SUPC_WUIR_WKUPT1_HIGH_Val << SUPC_WUIR_WKUPT1_Pos)  /* (SUPC_WUIR) A rising edge followed by a high level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply. Position  */
#define SUPC_WUIR_WKUPT2_Pos                  _UINT32_(18)                                         /* (SUPC_WUIR) Wake-up Input Type 2 Position */
#define SUPC_WUIR_WKUPT2_Msk                  (_UINT32_(0x1) << SUPC_WUIR_WKUPT2_Pos)              /* (SUPC_WUIR) Wake-up Input Type 2 Mask */
#define SUPC_WUIR_WKUPT2(value)               (SUPC_WUIR_WKUPT2_Msk & (_UINT32_(value) << SUPC_WUIR_WKUPT2_Pos)) /* Assigment of value for WKUPT2 in the SUPC_WUIR register */
#define   SUPC_WUIR_WKUPT2_LOW_Val            _UINT32_(0x0)                                        /* (SUPC_WUIR) A falling edge followed by a low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply.  */
#define   SUPC_WUIR_WKUPT2_HIGH_Val           _UINT32_(0x1)                                        /* (SUPC_WUIR) A rising edge followed by a high level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply.  */
#define SUPC_WUIR_WKUPT2_LOW                  (SUPC_WUIR_WKUPT2_LOW_Val << SUPC_WUIR_WKUPT2_Pos)   /* (SUPC_WUIR) A falling edge followed by a low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply. Position  */
#define SUPC_WUIR_WKUPT2_HIGH                 (SUPC_WUIR_WKUPT2_HIGH_Val << SUPC_WUIR_WKUPT2_Pos)  /* (SUPC_WUIR) A rising edge followed by a high level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply. Position  */
#define SUPC_WUIR_WKUPT3_Pos                  _UINT32_(19)                                         /* (SUPC_WUIR) Wake-up Input Type 3 Position */
#define SUPC_WUIR_WKUPT3_Msk                  (_UINT32_(0x1) << SUPC_WUIR_WKUPT3_Pos)              /* (SUPC_WUIR) Wake-up Input Type 3 Mask */
#define SUPC_WUIR_WKUPT3(value)               (SUPC_WUIR_WKUPT3_Msk & (_UINT32_(value) << SUPC_WUIR_WKUPT3_Pos)) /* Assigment of value for WKUPT3 in the SUPC_WUIR register */
#define   SUPC_WUIR_WKUPT3_LOW_Val            _UINT32_(0x0)                                        /* (SUPC_WUIR) A falling edge followed by a low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply.  */
#define   SUPC_WUIR_WKUPT3_HIGH_Val           _UINT32_(0x1)                                        /* (SUPC_WUIR) A rising edge followed by a high level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply.  */
#define SUPC_WUIR_WKUPT3_LOW                  (SUPC_WUIR_WKUPT3_LOW_Val << SUPC_WUIR_WKUPT3_Pos)   /* (SUPC_WUIR) A falling edge followed by a low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply. Position  */
#define SUPC_WUIR_WKUPT3_HIGH                 (SUPC_WUIR_WKUPT3_HIGH_Val << SUPC_WUIR_WKUPT3_Pos)  /* (SUPC_WUIR) A rising edge followed by a high level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply. Position  */
#define SUPC_WUIR_WKUPT4_Pos                  _UINT32_(20)                                         /* (SUPC_WUIR) Wake-up Input Type 4 Position */
#define SUPC_WUIR_WKUPT4_Msk                  (_UINT32_(0x1) << SUPC_WUIR_WKUPT4_Pos)              /* (SUPC_WUIR) Wake-up Input Type 4 Mask */
#define SUPC_WUIR_WKUPT4(value)               (SUPC_WUIR_WKUPT4_Msk & (_UINT32_(value) << SUPC_WUIR_WKUPT4_Pos)) /* Assigment of value for WKUPT4 in the SUPC_WUIR register */
#define   SUPC_WUIR_WKUPT4_LOW_Val            _UINT32_(0x0)                                        /* (SUPC_WUIR) A falling edge followed by a low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply.  */
#define   SUPC_WUIR_WKUPT4_HIGH_Val           _UINT32_(0x1)                                        /* (SUPC_WUIR) A rising edge followed by a high level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply.  */
#define SUPC_WUIR_WKUPT4_LOW                  (SUPC_WUIR_WKUPT4_LOW_Val << SUPC_WUIR_WKUPT4_Pos)   /* (SUPC_WUIR) A falling edge followed by a low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply. Position  */
#define SUPC_WUIR_WKUPT4_HIGH                 (SUPC_WUIR_WKUPT4_HIGH_Val << SUPC_WUIR_WKUPT4_Pos)  /* (SUPC_WUIR) A rising edge followed by a high level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply. Position  */
#define SUPC_WUIR_WKUPT5_Pos                  _UINT32_(21)                                         /* (SUPC_WUIR) Wake-up Input Type 5 Position */
#define SUPC_WUIR_WKUPT5_Msk                  (_UINT32_(0x1) << SUPC_WUIR_WKUPT5_Pos)              /* (SUPC_WUIR) Wake-up Input Type 5 Mask */
#define SUPC_WUIR_WKUPT5(value)               (SUPC_WUIR_WKUPT5_Msk & (_UINT32_(value) << SUPC_WUIR_WKUPT5_Pos)) /* Assigment of value for WKUPT5 in the SUPC_WUIR register */
#define   SUPC_WUIR_WKUPT5_LOW_Val            _UINT32_(0x0)                                        /* (SUPC_WUIR) A falling edge followed by a low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply.  */
#define   SUPC_WUIR_WKUPT5_HIGH_Val           _UINT32_(0x1)                                        /* (SUPC_WUIR) A rising edge followed by a high level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply.  */
#define SUPC_WUIR_WKUPT5_LOW                  (SUPC_WUIR_WKUPT5_LOW_Val << SUPC_WUIR_WKUPT5_Pos)   /* (SUPC_WUIR) A falling edge followed by a low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply. Position  */
#define SUPC_WUIR_WKUPT5_HIGH                 (SUPC_WUIR_WKUPT5_HIGH_Val << SUPC_WUIR_WKUPT5_Pos)  /* (SUPC_WUIR) A rising edge followed by a high level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply. Position  */
#define SUPC_WUIR_WKUPT6_Pos                  _UINT32_(22)                                         /* (SUPC_WUIR) Wake-up Input Type 6 Position */
#define SUPC_WUIR_WKUPT6_Msk                  (_UINT32_(0x1) << SUPC_WUIR_WKUPT6_Pos)              /* (SUPC_WUIR) Wake-up Input Type 6 Mask */
#define SUPC_WUIR_WKUPT6(value)               (SUPC_WUIR_WKUPT6_Msk & (_UINT32_(value) << SUPC_WUIR_WKUPT6_Pos)) /* Assigment of value for WKUPT6 in the SUPC_WUIR register */
#define   SUPC_WUIR_WKUPT6_LOW_Val            _UINT32_(0x0)                                        /* (SUPC_WUIR) A falling edge followed by a low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply.  */
#define   SUPC_WUIR_WKUPT6_HIGH_Val           _UINT32_(0x1)                                        /* (SUPC_WUIR) A rising edge followed by a high level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply.  */
#define SUPC_WUIR_WKUPT6_LOW                  (SUPC_WUIR_WKUPT6_LOW_Val << SUPC_WUIR_WKUPT6_Pos)   /* (SUPC_WUIR) A falling edge followed by a low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply. Position  */
#define SUPC_WUIR_WKUPT6_HIGH                 (SUPC_WUIR_WKUPT6_HIGH_Val << SUPC_WUIR_WKUPT6_Pos)  /* (SUPC_WUIR) A rising edge followed by a high level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply. Position  */
#define SUPC_WUIR_WKUPT7_Pos                  _UINT32_(23)                                         /* (SUPC_WUIR) Wake-up Input Type 7 Position */
#define SUPC_WUIR_WKUPT7_Msk                  (_UINT32_(0x1) << SUPC_WUIR_WKUPT7_Pos)              /* (SUPC_WUIR) Wake-up Input Type 7 Mask */
#define SUPC_WUIR_WKUPT7(value)               (SUPC_WUIR_WKUPT7_Msk & (_UINT32_(value) << SUPC_WUIR_WKUPT7_Pos)) /* Assigment of value for WKUPT7 in the SUPC_WUIR register */
#define   SUPC_WUIR_WKUPT7_LOW_Val            _UINT32_(0x0)                                        /* (SUPC_WUIR) A falling edge followed by a low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply.  */
#define   SUPC_WUIR_WKUPT7_HIGH_Val           _UINT32_(0x1)                                        /* (SUPC_WUIR) A rising edge followed by a high level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply.  */
#define SUPC_WUIR_WKUPT7_LOW                  (SUPC_WUIR_WKUPT7_LOW_Val << SUPC_WUIR_WKUPT7_Pos)   /* (SUPC_WUIR) A falling edge followed by a low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply. Position  */
#define SUPC_WUIR_WKUPT7_HIGH                 (SUPC_WUIR_WKUPT7_HIGH_Val << SUPC_WUIR_WKUPT7_Pos)  /* (SUPC_WUIR) A rising edge followed by a high level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply. Position  */
#define SUPC_WUIR_WKUPT8_Pos                  _UINT32_(24)                                         /* (SUPC_WUIR) Wake-up Input Type 8 Position */
#define SUPC_WUIR_WKUPT8_Msk                  (_UINT32_(0x1) << SUPC_WUIR_WKUPT8_Pos)              /* (SUPC_WUIR) Wake-up Input Type 8 Mask */
#define SUPC_WUIR_WKUPT8(value)               (SUPC_WUIR_WKUPT8_Msk & (_UINT32_(value) << SUPC_WUIR_WKUPT8_Pos)) /* Assigment of value for WKUPT8 in the SUPC_WUIR register */
#define   SUPC_WUIR_WKUPT8_LOW_Val            _UINT32_(0x0)                                        /* (SUPC_WUIR) A falling edge followed by a low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply.  */
#define   SUPC_WUIR_WKUPT8_HIGH_Val           _UINT32_(0x1)                                        /* (SUPC_WUIR) A rising edge followed by a high level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply.  */
#define SUPC_WUIR_WKUPT8_LOW                  (SUPC_WUIR_WKUPT8_LOW_Val << SUPC_WUIR_WKUPT8_Pos)   /* (SUPC_WUIR) A falling edge followed by a low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply. Position  */
#define SUPC_WUIR_WKUPT8_HIGH                 (SUPC_WUIR_WKUPT8_HIGH_Val << SUPC_WUIR_WKUPT8_Pos)  /* (SUPC_WUIR) A rising edge followed by a high level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply. Position  */
#define SUPC_WUIR_WKUPT9_Pos                  _UINT32_(25)                                         /* (SUPC_WUIR) Wake-up Input Type 9 Position */
#define SUPC_WUIR_WKUPT9_Msk                  (_UINT32_(0x1) << SUPC_WUIR_WKUPT9_Pos)              /* (SUPC_WUIR) Wake-up Input Type 9 Mask */
#define SUPC_WUIR_WKUPT9(value)               (SUPC_WUIR_WKUPT9_Msk & (_UINT32_(value) << SUPC_WUIR_WKUPT9_Pos)) /* Assigment of value for WKUPT9 in the SUPC_WUIR register */
#define   SUPC_WUIR_WKUPT9_LOW_Val            _UINT32_(0x0)                                        /* (SUPC_WUIR) A falling edge followed by a low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply.  */
#define   SUPC_WUIR_WKUPT9_HIGH_Val           _UINT32_(0x1)                                        /* (SUPC_WUIR) A rising edge followed by a high level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply.  */
